{
    "number": "3-1",
    "name": "First Login",
    "description": "Welcome to the CIT Unix server! We'll be using this system for many purposes in this class, including Lab assignments. This is the first one. In this lab, you will be introduced to the 'lab' program, change your password and a few other basics. However, let's get something very important out of the way: changing your password.",
    "dataFiles": true,
    "submitMessage":"This lab was a basic introduction to the CIT Unix server, the 'lab' system, and a few basic Unix commands and concepts. You're now ready to take on some larger, more involved labs. Remember to contact your instructor if you have any problems with the CIT Unix server or the 'lab' system. And most importantly, have fun!",
    "steps": [
        {
            "shortText": "Changing your password",
            "text": "The first thing you need to do is change your password. Make it something long, but easy to remember.",
            "tasks": [
                "passwd  (no, that's not a typo, just type that command exactly)"
            ],
            "tips": "The 'passwd' command does NOT show your password as you type it, not even with asterisks. It may seem like it's not accepting input, but it is. This is done for security reasons, so that any nosy person looking over your shoulder cannot even see how long your password is.",
            "test": {
                "testType": "script",
                "command": "passwd.sh",
                "condition": true
            },
            "successMessage": "Excellent! Remember that this is NOT the same as your WVNCC student password. Make sure not to forget your password. It might even be a good time to start using a password manager!",
            "retryMessage": "Hmmm... Looks like something went wrong. Try the 'passwd' command again."
        },
        {
            "shortText": "Viewing the README.lab file",
            "text":"Ok, now that your password is updated, let's take a look at the 'lab' system that we'll be using, and that you're technically using right now. You'll do this by printing the contents of a file to your terminal screen.",
            "tasks": ["cat README.lab"],
            "test": {
                "testType": "command",
                "command": "true",
                "condition": true
            },
            "tips": "",
            "successMessage": "The 'cat' command allows you to dump the contents of a file to the terminal and view the contents of the file. Try this with any text file! It should not take long to get used to the lab tool. Ask your instructor if you need any help, or come across any problems with 'lab'.",
            "retryMessage": "I'm not sure why this would fail."
        },
        {
            "shortText": "Your Home Directory and Deleting a File",
            "text":"In this step you'll see what your home directory path is, as well as delete a file. The 'ls' command will be used before and after deleting the file.",
            "tasks":["pwd", "ls", "rm delete_me.txt", "ls"],
            "test": {
                "testType": "command",
                "command": "ls delete_me.txt",
                "condition": false
            },
            "tips": "Every user on this Unix system has what is called a 'home' directory. It is your own personal storage space where you can work through labs, experiment, create and store files. Any time you log into this system, your starting point will be your 'home' directory. The 'pwd' command shows you your present working directory. In this case it will be the full path of your 'home' directory. The 'rm' command is the 'remove' command to remove/delete a file. If this command is successful you will see NO OUTPUT. This is common among many basic Unix tools. The second 'ls' command should show that the file is now gone.",
            "successMessage":"You have successfully removed the file! The 'pwd' command stands for (P)resent (W)orking (D)irectory, and it shows you the folder/directory that you are currently \"in\". Directories are like little rooms that can contain files and doors to other directories. On the Command Line, you can only be in one directory at a time (unless you have multiple terminal windows open).",
            "retryMessage":"Hmmm... looks like the 'delete_me.txt' file is still there. Double check your command and check for typos. Remember that Unix filenames are usually case sensitive, so that must match as well."
        },
        {
            "shortText": "Delete another file without being told how",
            "text":"In this step, you'll delete a file, but you will not be given the exact command. See how the task above is shown in square brackets? This indicates a task where you are being asked to enter a command to perform the task, but you are not given the exact command. In this case you must figure out the command on your own.",
            "tasks":["[remove the file 'README.lab']"],
            "test":{
                "testType":"command",
                "command": "ls README.lab",
                "condition": false
            },
            "tips": "You will see more tasks like these as you progress through the course. You're allowed to look up the command in the book or course materials if you want. It may also be a good idea to keep a list of commands and what they do as a cheat sheet.",
            "successMessage":"Good work, the README.lab file is removed. If you need help with the 'lab' command, you can always read it's manual page by entering the command: man lab.",
            "retryMessage":"Hmmm... looks like the 'README.lab' file is still there. Double check your command and check for typos. Remember that Unix filenames are usually case sensitive, so that must match as well."
        }
    ],
    "flags": [2024],
    "bonusFlags": [4200]
}
